uat_chat/DataProcessors/уатРасписаниеМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>уатРасписаниеМаршрутов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВыходыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

uat_chat/InformationRegisters/уатРасписаниеРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатРасписаниеРейсов</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пн</Name>
					<Comment>Понедельник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вт</Name>
					<Comment>Вторник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ср</Name>
					<Comment>Среда</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чт</Name>
					<Comment>Четверг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пт</Name>
					<Comment>Пятница</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сб</Name>
					<Comment>Суббота</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вс</Name>
					<Comment>Воскресенье</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВыходыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРейсыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДПункта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатМаршруты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрутаОднимПунктом</Name>
					<Comment>Ложь-пары пунктов, Истина-один пункт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоянка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЫВПеч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПутиВод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл2Вод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУсл3Вод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПоездки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыПоездок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПозицияПроизводсвеннойПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<Comment>Этапы движения по маршруту</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Comment>Пункт отправления</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПрибытия</Name>
							<Comment>Пункт прибытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Comment>Расстояние</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/DataProcessors/уатРасписаниеМаршрутов/Ext/ObjectModule.bsl
//Процедура заполняет рейсы маршрута в табличном документе по заданным маршруту и выходу
//Параметры:
//	ТабДокумент - табличный документ, куда будут выведены рейсы,
//	Маршрут, Выход - маршрут и выход, по которым заполняются рейсы,
//	Индикатор - флаг отображения индикации вывода.
//
Процедура ЗаполнитьРейсыМаршрута(ТабДокумент, Маршрут, Выход, Индикатор = Ложь)	Экспорт
	
	Если Индикатор Тогда
		ФормаИндикатора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
		ФормаИндикатора.КомментарийЗначения = "Заполнение расписания маршрута";
		ФормаИндикатора.Открыть();
		Инд = 0;
	КонецЕсли;	
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапкаПункт = Макет.ПолучитьОбласть("Шапка|Пункт");
	ОбластьШапкаРейс = Макет.ПолучитьОбласть("Шапка|Рейс");
	ТабДокумент.Вывести(ОбластьШапкаПункт);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатРейсыМаршрутов.Код КАК НомерРейса,
	|	уатРейсыМаршрутов.Ссылка КАК Рейс
	|ИЗ
	|	Справочник.уатРейсыМаршрутов КАК уатРейсыМаршрутов
	|ГДЕ
	|	уатРейсыМаршрутов.Владелец = &Маршрут
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРейса";
	
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	
	мРейсы = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтрока Из мРейсы Цикл
		
		ОбластьШапкаРейс.Параметры.Рейс = "Рейс " + ТекСтрока.НомерРейса;
		ОбластьШапкаРейс.Параметры.РейсСсылка = ТекСтрока.Рейс;
		ТабДокумент.Присоединить(ОбластьШапкаРейс);
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатПунктыМаршрута.УИД КАК УИДПункта,
	|	уатПунктыМаршрута.ПунктОтправления.Наименование КАК Наименование,
	|	уатПунктыМаршрута.ПунктОтправления КАК Пункт,
	|	уатПунктыМаршрута.НомерСтроки КАК Номер
	|ИЗ
	|	Справочник.уатМаршруты.Этапы КАК уатПунктыМаршрута
	|ГДЕ
	|	уатПунктыМаршрута.Ссылка = &Маршрут
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	
	ВыборкаЗапросаПункты = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатРасписаниеРейсов.ВремяПрибытия,
	|	уатРасписаниеРейсов.ВремяУбытия,
	|	уатРасписаниеРейсов.Пн,
	|	уатРасписаниеРейсов.Вт,
	|	уатРасписаниеРейсов.Ср,
	|	уатРасписаниеРейсов.Чт,
	|	уатРасписаниеРейсов.Пт,
	|	уатРасписаниеРейсов.Сб,
	|	уатРасписаниеРейсов.Вс
	|ИЗ
	|	РегистрСведений.уатРасписаниеРейсов КАК уатРасписаниеРейсов
	|ГДЕ
	|	уатРасписаниеРейсов.Маршрут = &Маршрут
	|	И уатРасписаниеРейсов.Рейс = &Рейс
	|	И уатРасписаниеРейсов.УИДПункта = &УИДПункта
	|	И уатРасписаниеРейсов.Выход = &Выход";
	
	ОбластьСтрокаПункт = Макет.ПолучитьОбласть("Строка|Пункт");
	ОбластьСтрокаРейс = Макет.ПолучитьОбласть("Строка|Рейс");
		
	Если Индикатор Тогда
		КолСтрок = ВыборкаЗапросаПункты.Количество();
	КонецЕсли;	
	
	мНомерРейса = 0;
	
	Пока ВыборкаЗапросаПункты.Следующий() Цикл
		
		ОбластьСтрокаПункт.Параметры.Заполнить(ВыборкаЗапросаПункты);
		ТабДокумент.Вывести(ОбластьСтрокаПункт);
		
		мНомерРейса = 0;
		Для Каждого ТекСтрока Из мРейсы Цикл
			Запрос.УстановитьПараметр("Маршрут", Маршрут);
			Запрос.УстановитьПараметр("Выход", Выход);
			Запрос.УстановитьПараметр("УИДПункта", ВыборкаЗапросаПункты.УИДПункта);
			Запрос.УстановитьПараметр("Рейс", ТекСтрока.Рейс);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				ОбластьСтрокаРейс.Параметры.Заполнить(ВыборкаЗапроса);
				ОбластьСтрокаРейс.Область(1, 3, 1, 3).Значение = ВыборкаЗапроса.Пн;
				ОбластьСтрокаРейс.Область(1, 4, 1, 4).Значение = ВыборкаЗапроса.Вт;
				ОбластьСтрокаРейс.Область(1, 5, 1, 5).Значение = ВыборкаЗапроса.Ср;
				ОбластьСтрокаРейс.Область(1, 6, 1, 6).Значение = ВыборкаЗапроса.Чт;
				ОбластьСтрокаРейс.Область(1, 7, 1, 7).Значение = ВыборкаЗапроса.Пт;
				ОбластьСтрокаРейс.Область(1, 8, 1, 8).Значение = ВыборкаЗапроса.Сб;
				ОбластьСтрокаРейс.Область(1, 9, 1, 9).Значение = ВыборкаЗапроса.Вс;
				
			Иначе	
				ОбластьСтрокаРейс.Параметры.ВремяПрибытия = "";
				ОбластьСтрокаРейс.Параметры.ВремяУбытия = "";
				
				ОбластьСтрокаРейс.Область(1, 3, 1, 3).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 4, 1, 4).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 5, 1, 5).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 6, 1, 6).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 7, 1, 7).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 8, 1, 8).Значение = ЛОЖЬ;
				ОбластьСтрокаРейс.Область(1, 9, 1, 9).Значение = ЛОЖЬ;
			КонецЕсли;
			
			мОбласть 				= ТабДокумент.Присоединить(ОбластьСтрокаРейс);
			мОбласть.Защита 		= Ложь;
						
			мНомерРейса 			= мНомерРейса + 1;
			Если мНомерРейса % 2 = 0 Тогда
				мОбласть.ЦветФона	= WebЦвета.АкварельноСиний;
			Иначе
				мОбласть.ЦветФона	= WebЦвета.Бежевый;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если Индикатор Тогда
			Инд = Инд + 1;
			ФормаИндикатора.ЭлементыФормы.Индикатор.Значение = Инд/КолСтрок * 100;
		КонецЕсли;	
	КонецЦикла;
	
	//выводим подвал
	ОбластьПодвалПункт = Макет.ПолучитьОбласть("Подвал|Пункт");
	ОбластьПодвалРейс = Макет.ПолучитьОбласть("Подвал|Рейс");
	
	ТабДокумент.Вывести(ОбластьПодвалПункт);
	Для Сч = 1 По мНомерРейса Цикл
		ТабДокумент.Присоединить(ОбластьПодвалРейс);
	КонецЦикла;
	
	ТабДокумент.ФиксацияСверху = 2;
	ТабДокумент.ФиксацияСлева = 2;
	
	Если Индикатор Тогда
		ФормаИндикатора.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

#Если Клиент Тогда
	
//Процедура копирует рейс для указанного выхода
//Копируется всё расписание рейса
Процедура СкопироватьРейс(мВыход, мРейс) Экспорт
	Перем мВремя;
	
	Если ВвестиДату(мВремя, "Продолжительность", ЧастиДаты.Время) Тогда
		мНовыйРейс	= мРейс.ПолучитьОбъект().Скопировать();
		мНовыйРейс.УстановитьНовыйКод();
		мНовыйРейс.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатРасписаниеРейсов.Маршрут,
		|	уатРасписаниеРейсов.Выход,
		|	уатРасписаниеРейсов.Рейс,
		|	уатРасписаниеРейсов.УИДПункта,
		|	уатРасписаниеРейсов.ВремяПрибытия,
		|	уатРасписаниеРейсов.ВремяУбытия,
		|	уатРасписаниеРейсов.Пн,
		|	уатРасписаниеРейсов.Вт,
		|	уатРасписаниеРейсов.Ср,
		|	уатРасписаниеРейсов.Чт,
		|	уатРасписаниеРейсов.Пт,
		|	уатРасписаниеРейсов.Сб,
		|	уатРасписаниеРейсов.Вс
		|ИЗ
		|	РегистрСведений.уатРасписаниеРейсов КАК уатРасписаниеРейсов
		|ГДЕ
		|	уатРасписаниеРейсов.Выход = &Выход
		|	И уатРасписаниеРейсов.Рейс = &Рейс";
		
		Запрос.УстановитьПараметр("Выход", мВыход);
		Запрос.УстановитьПараметр("Рейс", мРейс);
		ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗаписей.Следующий() Цикл
			мЗапись = РегистрыСведений.уатРасписаниеРейсов.СоздатьМенеджерЗаписи();
			мЗапись.ВремяПрибытия	= ВыборкаЗаписей.ВремяПрибытия + 3600*Час(мВремя) + 60*Минута(мВремя) + Секунда(мВремя);
			мЗапись.ВремяУбытия		= ВыборкаЗаписей.ВремяУбытия + 3600*Час(мВремя) + 60*Минута(мВремя) + Секунда(мВремя);
			мЗапись.Маршрут			= ВыборкаЗаписей.Маршрут;
			мЗапись.Рейс			= мНовыйРейс.Ссылка;
			мЗапись.Выход			= ВыборкаЗаписей.Выход;
			мЗапись.УИДПункта		= ВыборкаЗаписей.УИДПункта;
			мЗапись.Пн = ВыборкаЗаписей.Пн;
			мЗапись.Вт = ВыборкаЗаписей.Вт;
			мЗапись.Ср = ВыборкаЗаписей.Ср;
			мЗапись.Чт = ВыборкаЗаписей.Чт;
			мЗапись.Пт = ВыборкаЗаписей.Пт;
			мЗапись.Сб = ВыборкаЗаписей.Сб;
			мЗапись.Вс = ВыборкаЗаписей.Вс;
			мЗапись.Записать();
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
	
//Функция пересчитывает время отправления
//по указанным Маршруту, Выходу и Рейсу
//Время убытия рассчитывается, как время прибытия + введенное время
Функция ПересчитатьВремяОтправления(мМаршрут, мВыход, мРейс) Экспорт
	
	Перем мВремя;
	
	Если НЕ ВвестиДату(мВремя, "Укажите временную разницу", ЧастиДаты.Время) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мВремя) тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уатРасписаниеРейсов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Маршрут.Значение 		= мМаршрут;
	НаборЗаписей.Отбор.Маршрут.Использование 	= Истина;
	НаборЗаписей.Отбор.Рейс.Значение 			= мРейс;
	НаборЗаписей.Отбор.Рейс.Использование 		= Истина;
	НаборЗаписей.Отбор.Выход.Значение 			= мВыход;
	НаборЗаписей.Отбор.Выход.Использование 		= Истина;
	НаборЗаписей.Прочитать();
	
	Для сч = 0 По НаборЗаписей.Количество() - 1 Цикл
		
		НаборЗаписей[сч].ВремяУбытия	= НаборЗаписей[сч].ВремяПрибытия + 3600*Час(мВремя) + 60*Минута(мВремя) + Секунда(мВремя);;
		
	КонецЦикла;	
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

//Печать маршрута.
//Вывод производится в новый табличный документ, которые далее можно вывести на печать
//
Процедура ПечатьМаршрута(мМаршрут, мВыход) Экспорт
	
	Макет = ПолучитьМакет("Макет");
	ТабДокПеч = Новый ТабличныйДокумент;
	
	ЗаполнитьРейсыМаршрута(ТабДокПеч, мМаршрут, мВыход, Ложь);
	
	ТабДокПеч.ОтображатьЗаголовки 	= Ложь;
	ТабДокПеч.ОтображатьСетку 		= Ложь;
	ТабДокПеч.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокПеч.ЧерноБелаяПечать 		= Истина;
	
	//корректировка ширины колонок
	//при выводе более одного рейса колонки дней недели, начиная со второго рейса, становятся автошириной
	
	
	ТабДокПеч.Показать();
	//ТабДокПеч.Напечатать();
	
КонецПроцедуры

#КонецЕсли
